@extends('frontend.layout')
@section('main-content')
    <div class="min-h-[calc(100vh-239px)]">
        <div class="container mx-auto pt-24 py-7">
            <div class="p-5 flex items-center flex-col">
                <div class="md:w-2/3 rounded mb-7"><img
                        src="https://images.prothomalo.com/prothomalo-bangla%2F2021-09%2Fe8174444-5bf1-4f91-8416-f9ea279cb21a%2Fscratchpng.png?auto=format%2Ccompress&amp;fmt=webp&amp;format=webp&amp;w=640&amp;dpr=2.0">
                </div>
                <div class="">
                    <div class="md:flex justify-between items-center">
                        <h1 class="text-2xl font-bold">1. স্ক্র্যাচে এখন থেকে বাংলাতেই প্রোগ্রামিং শেখা যাবে</h1>
                        <p>Publish Date: ২৫ সেপ্টেম্বর ২০২১, ১৭: ৪৩ </p>
                    </div>
                    <p class="border-b-2 py-5">জনপ্রিয় স্ক্র্যাচ প্ল্যাটফর্মে এখন থেকে বাংলা ভাষাতেই প্রোগ্রামিং ও
                        প্রজেক্ট করা যাবে। বিশ্বের ১৯০টি দেশের শিশু-কিশোরদের প্রোগ্রামিং শেখার এ প্ল্যাটফর্ম
                        যুক্তরাষ্ট্রের ম্যাসাচুসেটস ইনস্টিটিউট অব টেকনোলজির (এমআইটি) মিডিয়া ল্যাবে উদ্ভাবিত। অনলাইন
                        প্ল্যাটফর্মে আয়োজিত ‘বাংলায় স্ক্র্যাচ প্রোগ্রামিং’-এর উদ্বোধনী অনুষ্ঠানে গতকাল শুক্রবার এ তথ্য
                        জানানো হয়। স্ক্র্যাচ একটি ব্লকভিত্তিক ভিজ্যুয়াল প্রোগ্রামিং ভাষা, যা দিয়ে খুব সহজেই প্রোগ্রামিং
                        লজিক শেখা যায় ও গেম, অ্যানিমেশন ভিডিও, স্টোরি ভিডিওসহ নানা ধরনের সফটওয়্যার তৈরি করা যায়।
                        উদ্বোধনী অনুষ্ঠানে বলা হয়, দেশে প্রোগ্রামিং চর্চাকে জনপ্রিয় এবং সহজ করতে স্ক্র্যাচের ওয়েবসাইটে
                        <a class="text-blue-500" href="https://scratch.mit.edu/">(scratch.mit.edu)</a> যুক্ত হয়েছে বাংলা
                        ভাষা। স্কুল-কলেজের শিক্ষার্থী থেকে শুরু করে বড়রাও খুব সহজে বাংলা ভাষায় প্রোগ্রামিং শিখতে পারবে।
                        এ ছাড়া আগামী শিক্ষাবর্ষ থেকে প্রাথমিকের শিক্ষার্থীরাও বাংলা ভাষায় প্রোগ্রামিং চর্চা করতে পারে এ
                        প্ল্যাটফর্মে। কম্পিউটার সার্ভিসেস লিমিটেডের সহযোগিতায় বাংলাদেশ ওপেন সোর্স নেটওয়ার্ক (বিডিওএসএন)
                        স্ক্র্যাচ প্ল্যাটফর্মে বাংলা যুক্ত করার কাজটি করেছে।<br>অনুষ্ঠানে প্রধান অতিথি ছিলেন বাংলাদেশ
                        সরকারের ডাক ও টেলিযোগাযোগমন্ত্রী মোস্তাফা জব্বার। বিশেষ অতিথি হিসেবে উপস্থিত ছিলেন অ্যাসোসিওর
                        সাবেক চেয়ারম্যান আবদুল্লাহ এইচ কাফি ও সভাপতিত্ব করেন লেখক ও শিক্ষাবিদ মুহম্মদ জাফর ইকবাল। বাংলা
                        ভাষার জন্য আজকের দিনটিকে মাইলফলক উল্লেখ করে মোস্তাফা জব্বার বলেন, ছোটদের প্রোগ্রামিং শেখার একটি
                        হাতিয়ার স্ক্র্যাচের বাংলা প্রোগ্রামিং। যেকোনো শিশু প্রোগ্রামিংয়ের ক্ষেত্রে দক্ষ হওয়ার জন্য
                        স্ক্র্যাচ দিয়েই তার প্রোগ্রামিং যাত্রা শুরু করতে পারে। তিনি আরও বলেন, স্নাতক পর্যায়ে অনেক
                        শিক্ষার্থী প্রোগ্রামিং শেখার আগ্রহ পায় না। ছোটবেলায় মাতৃভাষায় প্রোগ্রামিংয়ে হাতেখড়ি হয়ে গেলে সেই
                        সংকট কেটে যাবে। অনুষ্ঠানে মুহম্মদ জাফর ইকবাল বলেন, ‘বাংলা ভাষায় প্রোগ্রামিং শেখার একটা
                        প্ল্যাটফর্ম করতে পেরেছি, এটাই সব থেকে বড় ব্যাপার। কোনো ভালো কিছু করার ক্ষেত্রে লজ্জা-ঘৃণা-ভয়—এই
                        তিন থাকতে নয়। এগুলোকে পেছনে ফেলে সামনে এগিয়ে যেতে হবে।’ প্রথম আলোর যুব কার্যক্রমের প্রধান মুনির
                        হাসানের সঞ্চালনায় অনুষ্ঠানে আরও বক্তব্য দেন ঢাকা বিশ্ববিদ্যালয়ের অধ্যাপক লাফিফা জামাল, জাতীয়
                        শিক্ষাক্রম ও পাঠ্যপুস্তক বোর্ড (এনসিটিবি), বাংলাদেশের প্রাথমিক শিক্ষাক্রমের সদস্য অধ্যাপক এ কে
                        এম রিয়াজুল হাসান প্রমুখ।
                    </p>
                    <div class="flex justify-around">
                        <p class="link no-underline">Like</p>
                        <p class="link no-underline">Comment</p>
                        <p class="link no-underline">Share</p>
                    </div>
                </div>
            </div>
        </div>
    </div>
@endsection
